ADV-90 算法提高 输出日历
按照下述格式打印2006年12月日历：
Calendar 2006-12
--------------------------
Su  Mo  Tu  We  Th  Fr  Sa
--------------------------
                     1   2
 3   4   5   6   7   8   9
10  11  12  13  14  15  16
17  18  19  20  21  22  23
24  25  26  27  28  29  30
31
--------------------------
注意：表头和表中的英文字符大小写要与题目中一致，短线“-”个数要与题目中一致，否则系统会判为错误。

#include <iostream>
using namespace std;
int main() {
    cout << "Calendar 2006-12\n--------------------------\nSu  Mo  Tu  We  Th  Fr  Sa\n--------------------------\n";
    cout << "                     1   2\n 3   4   5   6   7   8   9\n10  11  12  13  14  15  16\n17  18  19  20  21  22  23\n";
    cout << "24  25  26  27  28  29  30\n31\n--------------------------";
    return 0;
}