算法提高 格式化数据输出  
编制程序，输出下述数据。说明：（1）表中数据来自总参谋部测绘局编制的
《世界地图集》（星球地图出版社，2004年1月第2版），数据可能已不准确；
（2）面积单位为万平方公里，人口单位为万人，GDP单位为十亿美元；
（3）表中所有数据都必须以变量的形式保存；（4）如果不知道每字段宽度
到底为多少，请仔细数数作为分隔标记的短横数目。
---------------------------------------------------
COUNTRY     AREA(10K km2)  POP.(10K)  GDP(Billion$)
---------------------------------------------------
China              960.00  129500.00  1080.00
Iceland             10.30      27.57  8.20
India              297.47   97000.00  264.80
Madagascar          62.70    1635.00  3.60
Maldive            0.0298      27.80  0.23
---------------------------------------------------
注意：输出时空格与短线的数量要与上面格式严格一致，否则系统会判为错误。
 
#include <iostream>
using namespace std;
int main() {
	cout << "---------------------------------------------------\nCOUNTRY     AREA(10K km2)  POP.(10K)  GDP(Billion$)\n---------------------------------------------------\nChina              960.00  129500.00  1080.00\n";
	cout << "Iceland             10.30      27.57  8.20\nIndia              297.47   97000.00  264.80\nMadagascar          62.70    1635.00  3.60\nMaldive            0.0298      27.80  0.23\n";
	cout << "---------------------------------------------------\n";
	return 0;
}